---
title: Mullion
classe: Autodesk.Revit.DB.Mullion
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FamilyInstance
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# Mullion

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Curve LocationCurve { get; }` | `mullion.LocationCurve` | Curve |
| `Boolean Lock { get; set; }` | `mullion.Lock` | Boolean |
| `Boolean Lockable { get; }` | `mullion.Lockable` | Boolean |
| `MullionType MullionType { get; set; }` | `mullion.MullionType` | MullionType |
| `Void BreakMullion()` | `mullion.BreakMullion()` | Void |
| `Void JoinMullion()` | `mullion.JoinMullion()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```